In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [8]:
ser1 = Series(np.arange(3), index = ['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int32

In [9]:
ser1 = 2 * ser1

In [10]:
ser1

A    0
B    2
C    4
dtype: int32

In [12]:
ser1['B']

2

In [14]:
ser1[1]

2

In [16]:
ser1[0:3]

A    0
B    2
C    4
dtype: int32

In [17]:
ser1[['A','B']]

A    0
B    2
dtype: int32

In [19]:
ser1[ser1>3]

C    4
dtype: int32

In [21]:
ser1[ser1>3] = 10

In [23]:
ser1

A     0
B     2
C    10
dtype: int32

In [26]:
# dataframe
dframe = DataFrame(np.arange(25).reshape((5,5)), index = ['NYC','LA','SF','DC','CHI'], 
                   columns = ['A','B','C','D','E'])

In [28]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [30]:
## select data from dataframe
dframe['B']

NYC     1
LA      6
SF     11
DC     16
CHI    21
Name: B, dtype: int32

In [32]:
dframe[['A','E']]

      A   E
NYC   0   4
LA    5   9
SF   10  14
DC   15  19
CHI  20  24

In [34]:
dframe[dframe['C'] > 8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [36]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [38]:
## boolean dataframe
dframe > 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
CHI   True   True   True   True   True

In [39]:
# ix for label index
dframe.ix['LA']

AttributeError: 'DataFrame' object has no attribute 'ix'

In [41]:
# dframe.ix['LA'] not working
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [45]:
#dframe.ix[1] not working
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32